#include "MongoDBConnector.h"




int main(){

  
//инициализация драйвера
mongocxx::instance instance{};

  
//инициализация и подключение базы данных
MongoDBConnector connector{ "mongodb://localhost:27017" };


//Пример как можно задать имена базы данных и коллекции  
const char* database_name = "DBName";
const char* collection_name = "ColName";

/-------------------------------------------------/
//Пример как пользоваться методом Create()  
  
connector.Create(database_name1, collection_name);
  
/-------------------------------------------------/
  //Пример как пользоваться методом Drop()

  connector.Drop(database_name);

/-------------------------------------------------/


/-------------------------------------------------/
/-------------------------------------------------/
/-------------------------------------------------/
/-------------------------------------------------/
/-------------------------------------------------/
/-------------------------------------------------/




  
  
}
